项目管理/01 准备阶段/开发培训/SAP系统集成培训/创建客户主数据接口 案例/document.xml

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions targetNamespace="urn:sap-com:document:sap:soap:functions:mc-style" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsoap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:tns="urn:sap-com:document:sap:soap:functions:mc-style" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:n1="urn:sap-com:document:sap:rfc:functions"><wsdl:documentation><sidl:sidl xmlns:sidl="http://www.sap.com/2007/03/sidl"/></wsdl:documentation><wsp:UsingPolicy wsdl:required="true"/><wsp:Policy wsu:Id="BN_BN_binding"><saptrnbnd:OptimizedXMLTransfer uri="http://xml.sap.com/2006/11/esi/esp/binxml" xmlns:saptrnbnd="http://www.sap.com/webas/710/soap/features/transportbinding/" wsp:Optional="true"/><saptrnbnd:OptimizedMimeSerialization xmlns:saptrnbnd="http://schemas.xmlsoap.org/ws/2004/09/policy/optimizedmimeserialization" wsp:Optional="true"/><wsp:ExactlyOne xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"><wsp:All><sp:TransportBinding xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702" xmlns:sapsp="http://www.sap.com/webas/630/soap/features/security/policy" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/07/utility" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken><wsp:Policy><sp:HttpBasicAuthentication/></wsp:Policy></sp:HttpsToken></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic128Rsa15/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne><wsaw:UsingAddressing xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" wsp:Optional="true"/></wsp:Policy><wsp:Policy wsu:Id="BN_BN_binding_SOAP12"><saptrnbnd:OptimizedXMLTransfer uri="http://xml.sap.com/2006/11/esi/esp/binxml" xmlns:saptrnbnd="http://www.sap.com/webas/710/soap/features/transportbinding/" wsp:Optional="true"/><saptrnbnd:OptimizedMimeSerialization xmlns:saptrnbnd="http://schemas.xmlsoap.org/ws/2004/09/policy/optimizedmimeserialization" wsp:Optional="true"/><wsp:ExactlyOne xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"><wsp:All><sp:TransportBinding xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702" xmlns:sapsp="http://www.sap.com/webas/630/soap/features/security/policy" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/07/utility" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken><wsp:Policy><sp:HttpBasicAuthentication/></wsp:Policy></sp:HttpsToken></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic128Rsa15/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne><wsaw:UsingAddressing xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" wsp:Optional="true"/></wsp:Policy><wsp:Policy wsu:Id="IF_IF_zz_cks_sd_customer"><sapsession:Session xmlns:sapsession="http://www.sap.com/webas/630/soap/features/session/"><sapsession:enableSession>false</sapsession:enableSession></sapsession:Session><sapcentraladmin:CentralAdministration xmlns:sapcentraladmin="http://www.sap.com/webas/700/soap/features/CentralAdministration/" wsp:Optional="true"><sapcentraladmin:BusinessApplicationID>0018FE7972821DEFB0CD97950B095362</sapcentraladmin:BusinessApplicationID></sapcentraladmin:CentralAdministration></wsp:Policy><wsp:Policy wsu:Id="OP_IF_OP_ZapiSdCustomerMaintain"><sapcomhnd:enableCommit xmlns:sapcomhnd="http://www.sap.com/NW05/soap/features/commit/">false</sapcomhnd:enableCommit><sapblock:enableBlocking xmlns:sapblock="http://www.sap.com/NW05/soap/features/blocking/">true</sapblock:enableBlocking><saptrhnw05:required xmlns:saptrhnw05="http://www.sap.com/NW05/soap/features/transaction/">no</saptrhnw05:required><saprmnw05:enableWSRM xmlns:saprmnw05="http://www.sap.com/NW05/soap/features/wsrm/">false</saprmnw05:enableWSRM></wsp:Policy><wsdl:types><xsd:schema attributeFormDefault="qualified" targetNamespace="urn:sap-com:document:sap:rfc:functions"><xsd:simpleType name="char1"><xsd:restriction base="xsd:string"><xsd:maxLength value="1"/></xsd:restriction></xsd:simpleType><xsd:simpleType name="char10"><xsd:restriction base="xsd:string"><xsd:maxLength value="10"/></xsd:restriction></xsd:simpleType><xsd:simpleType name="char25"><xsd:restriction base="xsd:string"><xsd:maxLength value="25"/></xsd:restriction></xsd:simpleType><xsd:simpleType name="char255"><xsd:restriction base="xsd:string"><xsd:maxLength value="255"/></xsd:restriction></xsd:simpleType><xsd:simpleType name="char3"><xsd:restriction base="xsd:string"><xsd:maxLength value="3"/></xsd:restriction></xsd:simpleType><xsd:simpleType name="char30"><xsd:restriction base="xsd:string"><xsd:maxLength value="30"/></xsd:restriction></xsd:simpleType><xsd:simpleType name="char4"><xsd:restriction base="xsd:string"><xsd:maxLength value="4"/></xsd:restriction></xsd:simpleType><xsd:simpleType name="lang"><xsd:restriction base="xsd:string"><xsd:maxLength value="1"/></xsd:restriction></xsd:simpleType></xsd:schema><xsd:schema attributeFormDefault="qualified" targetNamespace="urn:sap-com:document:sap:soap:functions:mc-style" xmlns:n0="urn:sap-com:document:sap:rfc:functions"><xsd:import namespace="urn:sap-com:document:sap:rfc:functions"/><xsd:simpleType name="RfcException.Message.Number"><xsd:restriction base="xsd:string"><xsd:maxLength value="3"/><xsd:pattern value="\d*"/></xsd:restriction></xsd:simpleType><xsd:complexType name="RfcException.Message"><xsd:sequence><xsd:element name="ID" type="xsd:string"/><xsd:element name="Number" type="tns:RfcException.Message.Number"/></xsd:sequence></xsd:complexType><xsd:complexType name="ZapiSdCustomerMaintain.RfcException"><xsd:sequence><xsd:element name="Name" type="tns:ZapiSdCustomerMaintain.RfcExceptions"/><xsd:element name="Text" type="xsd:string" minOccurs="0"/><xsd:element name="Message" type="tns:RfcException.Message" minOccurs="0"/></xsd:sequence></xsd:complexType><xsd:simpleType name="ZapiSdCustomerMaintain.RfcExceptions"><xsd:restriction base="xsd:string"><xsd:enumeration value="Zcheckinfo"/></xsd:restriction></xsd:simpleType><xsd:element name="ZapiSdCustomerMaintain.Exception" type="tns:ZapiSdCustomerMaintain.RfcException"/><xsd:element name="ZapiSdCustomerMaintain"><xsd:complexType><xsd:sequence><xsd:element name="Ktokd" type="n0:char4"/><xsd:element name="Kunnr" type="n0:char10"/><xsd:element name="Land1" type="n0:char3"/><xsd:element name="Lzone" type="n0:char10"/><xsd:element name="Name1" type="n0:char30"/><xsd:element name="Ort01" type="n0:char25"/><xsd:element name="Spras" type="n0:lang"/><xsd:element name="Stras" type="n0:char30"/></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="ZapiSdCustomerMaintainResponse"><xsd:complexType><xsd:sequence><xsd:element name="Code" type="n0:char10"/><xsd:element name="Flag" type="n0:char1"/><xsd:element name="Msg" type="n0:char255"/></xsd:sequence></xsd:complexType></xsd:element></xsd:schema></wsdl:types><wsdl:message name="ZapiSdCustomerMaintain"><wsdl:part name="parameters" element="tns:ZapiSdCustomerMaintain"/></wsdl:message><wsdl:message name="ZapiSdCustomerMaintainResponse"><wsdl:part name="parameter" element="tns:ZapiSdCustomerMaintainResponse"/></wsdl:message><wsdl:message name="ZapiSdCustomerMaintain.Exception"><wsdl:part name="ZapiSdCustomerMaintain.Exception" element="tns:ZapiSdCustomerMaintain.Exception"/></wsdl:message><wsdl:portType name="zz_cks_sd_customer"><wsdl:documentation><sapdoc:sapdoc xmlns:sapdoc="urn:sap:esi:documentation"><sapdoc:docitem docURL="http://iwdfvm4711.wdf.sap.corp:8001/sap/bc/esdt/docu/sd_text?sap-client=800&amp;sd_name=ZZ_CKS_SD_CUSTOMER"/></sapdoc:sapdoc></wsdl:documentation><wsp:Policy><wsp:PolicyReference URI="#IF_IF_zz_cks_sd_customer"/></wsp:Policy><wsdl:operation name="ZapiSdCustomerMaintain"><wsp:Policy><wsp:PolicyReference URI="#OP_IF_OP_ZapiSdCustomerMaintain"/></wsp:Policy><wsdl:input message="tns:ZapiSdCustomerMaintain"/><wsdl:output message="tns:ZapiSdCustomerMaintainResponse"/><wsdl:fault name="ZapiSdCustomerMaintain.Exception" message="tns:ZapiSdCustomerMaintain.Exception"/></wsdl:operation></wsdl:portType><wsdl:binding name="binding" type="tns:zz_cks_sd_customer"><wsp:Policy><wsp:PolicyReference URI="#BN_BN_binding"/></wsp:Policy><soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/><wsdl:operation name="ZapiSdCustomerMaintain"><soap:operation style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output><wsdl:fault name="ZapiSdCustomerMaintain.Exception"><soap:fault name="ZapiSdCustomerMaintain.Exception" use="literal"/></wsdl:fault></wsdl:operation></wsdl:binding><wsdl:binding name="binding_SOAP12" type="tns:zz_cks_sd_customer"><wsp:Policy><wsp:PolicyReference URI="#BN_BN_binding_SOAP12"/></wsp:Policy><wsoap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/><wsdl:operation name="ZapiSdCustomerMaintain"><wsoap12:operation style="document"/><wsdl:input><wsoap12:body use="literal"/></wsdl:input><wsdl:output><wsoap12:body use="literal"/></wsdl:output><wsdl:fault name="ZapiSdCustomerMaintain.Exception"><wsoap12:fault name="ZapiSdCustomerMaintain.Exception" use="literal"/></wsdl:fault></wsdl:operation></wsdl:binding><wsdl:service name="service"><wsdl:port name="binding" binding="tns:binding"><soap:address location="https://iwdfvm4711.wdf.sap.corp/sap/bc/srt/rfc/sap/zz_cks_sd_customer/800/service/binding"/></wsdl:port><wsdl:port name="binding_SOAP12" binding="tns:binding_SOAP12"><wsoap12:address location="https://iwdfvm4711.wdf.sap.corp/sap/bc/srt/rfc/sap/zz_cks_sd_customer/800/service/binding"/></wsdl:port></wsdl:service></wsdl:definitions>