项目管理/01 准备阶段/系统集成方案的对比/SAP集成开发/创建客户主数据接口 案例/Request.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:soap:functions:mc-style">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZapiSdCustomerMaintain>
         <Ktokd>Z001</Ktokd>
         <Kunnr>510003</Kunnr>
         <Land1>CN</Land1>
         <Lzone>0000000001</Lzone>
         <Name1>梁其华接口测试23E</Name1>
         <Ort01>佛山</Ort01>
         <Spras>1</Spras>
         <Stras>fos rg</Stras>
      </urn:ZapiSdCustomerMaintain>
   </soapenv:Body>
</soapenv:Envelope>